// 正则枚举对象
export const regexEnum = {
  NUMBER: /^[\d]*$/,  // 数字
  NUMBER_LETTER: /^[\da-zA-Z]*$/,  // 数字或字母
  IMGCODE: /^[\da-zA-Z]{4}$/,  // 4位数字或字母图形验证码
  // NUMBER_SECOND: /^\d+\.?\d{0,2}$/,  // 最多保留2位小数的数字
  // NUMBER_DOT: /^[^\d\.]/g, // 只能输入数字跟小数点
  NUMBER_DOT: /(^[1-9]\d*\.?\d{0,1}$)|(^0(\.\d{1})?$)/,  // 最多保留1位小数的数字
  NUMBER_SECOND: /(^[1-9]\d*\.?\d{0,2}$)|(^0(\.\d{1,2})?$)/,  // 最多保留2位小数的数字
  USERNAME: /^([0-9]{12}|1[3|5|7|8|9][0-9]{9})$/, // 用户名格式
  MOBILE: /^1[3|4|5|6|7|8|9][0-9]{9}$/, // 手机号码
  PHONE_NUMBER: /((\+?[0-9]{2}\-?)?1[3|4|5|6|7|8|9][0-9]{9})|(([0-9]{3,4}\-?)?[0-9]{7,8})/, // 手机加固话
  // PHONE_NUMBER: /^([0-9]{2}\-)?(1[3|4|5|6|7|8|9][0-9]{9}|([0-9]{3,4}\-)[0-9]{7,8})$/, // 手机号+固话 ([0-9]{3,4}\-)?[0-9]{7,8})
  EMAIL: /^((\w+)|(\w+[!#$%&'*+\-,./=?^_`{|}~\w]*[!#$%&'*+\-,/=?^_`{|}~\w]))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.)|(([a-zA-Z0-9\-]+\.)+))([a-zA-Z]{2,10}|[0-9]{1,3})(\]?)$/, // 邮箱
  PASSWORD: /^[^\u4e00-\u9fa5\s]{6,16}$/, // 密码 非空非中文 6-16位
  SOCIAL_CODE: /^[0-9A-Za-z]{15}([0-9A-Za-z]{3})?$/,  // 统一社会信用代码 15 或 18 位 
  // VINCODE: /^[A-HJ-NPR-Z0-9]{17}$/, // VIN码(不能为I, O, Q)
  VINCODE: /^([0-9A-HJ-NPR-Z])[0-9A-HJ-NPR-Z]{16}$/, // VIN码(除了IOQ的17位数字或大写字母)
  // VINCODE: /^(?![^A-Z]+$)(?![^0-9]+$)[1-9A-HJ-NPR-Z][A-HJ-NPR-Z0-9]{16}$/, // VIN码(除了IOQ的17位数字或大写字母,首字母限制字母)旧
  // VINCODE: /^(?![^A-Z]+$)(?![^0-9]+$)[1-9WTJSKLVRYZ]{1}[A-HJ-NPR-Z0-9]{16}$/, // VIN码(不能是纯数字或纯字母，第1位限定（1~9 or W,T,J,S,K,L,V,R,Y,Z）)
  // PLATENO: /^[鲁皖澳京闽甘粤桂贵琼冀豫黑鄂湘吉苏赣辽蒙宁青晋陕沪川台津藏港新云浙渝使挂领港澳学警]{1}[A-Z]{1}[0-9a-zA-Z]{4}[0-9a-zA-Z\u4E00-\u9FA5]{1}$/, // 车牌号
  // PLATENO: /^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1})$/,
  PLATENO: /^[\u4e00-\u9fa5A-Z]{2,4}[\u4e00-\u9fa5A-HJ-NP-Z\d]{5,6}$/,
  PHONE_NO: /[^\d\+\-]/g, 
  REPLACE_NUMBER_DOT: /[^\d\.]/g,  // 替换成数字和点
  REPLACE_NUMBER: /[^\d]/g,  // 替换成数字
  ID_CARD: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/, //身份证
}
